Revit 2024 API
Camera.HorizontalExtent Property
 Horizontal extent of the camera's view, measured at target distance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double HorizontalExtent { get; set; }
Visual Basic
Public Property HorizontalExtent As Double
	Get
	Set
Visual C++
public:
property double HorizontalExtent {
	double get ();
	void set (double value);
}
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace